pmo-dataset/variations/mermaid_basic/12.mmd
graph LR
	Task_7["Adjust compensation"] --> ParallelGateway_3{"+"}
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_5{"X"}
	ParallelGateway_4{"+"} --> ExclusiveGateway_4{"X"}
	ParallelGateway_2{"+"} --> Task_10["Set new responsibilities"]
	Task_10 --> ParallelGateway_3
	ExclusiveGateway_4 --> Task_6["Work on skill enhancement"]
	StartEvent_1(("start")) --> Task_5["Identify development needs or career aspirations"]
	ExclusiveGateway_6{"X"} --> ParallelGateway_1{"+"}
	ExclusiveGateway_5 --> Task_8["Receive feedback and evaluation from supervisors"]
	Task_1["Transition into new role"] --> ExclusiveGateway_3{"X"}
	ParallelGateway_3 --> Task_1
	Task_4["Conducts formal performance review"] --> ExclusiveGateway_1{"X"}
	ParallelGateway_2 --> Task_7
	ExclusiveGateway_3 --> EndEvent_1(("end"))
	Task_6 --> ExclusiveGateway_6
	ExclusiveGateway_1 --> Task_9["Approve promotion"]
	Task_9 --> ParallelGateway_2
	ParallelGateway_4 --> ExclusiveGateway_5
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ExclusiveGateway_1 --> ExclusiveGateway_3
	Task_3["Consider employee for promotion or new role"] --> Task_4
	Task_8 --> ExclusiveGateway_2
	Task_2["Create personal development plan"] --> ParallelGateway_4
	ExclusiveGateway_2 --> ParallelGateway_1
	Task_5 --> Task_2
	ParallelGateway_1 --> Task_3
